<?php
/**
 * =========================================================
 * 					分页配置
 * 	分页配置的是各个需要各个功能在查询数据时查询的数据量
 * 	配置格式如下：
 * 		默认配置			_default	=>	xxx
 * 		其他配置			控制器名		=>	xxx
 * 	使用：
 * 		直接调用getPerPage()方法即可获得对应的分页
 * =========================================================
 */


return array(
	"_default"		=>	20,			//默认20条
	"User"			=>	25,			//用户管理分页
	"Course"		=>	10,			//用户课程管理分页
	"Class"			=>	10,			//班级管理
	"Essay"			=>	10,			//论文管理中心
	
	"_common"		=>	array(		//其他自定义配置
		"EducationGetEssayInfo"			=>	30,			//教学管理中获取毕业设计情况的分页
		"EducationGetEduInfo"			=>	30,			//获取教学情况页面分页
		
		"ExamTopicList"					=>	10			//考试题目列表
	)
);